(in-package :aoc-2024-15)

(aoc:define-day 1430536 nil)


;;; Input

(defun separate-input (input)
  (let ((split (position "" input :test #'string=)))
    (values (subseq input 0 split)
            (subseq input (1+ split)))))

(defun parse-input (input)
  (multiple-value-bind (map movements) (separate-input input)
    (list (aoc:parse-grid-to-array map) (format nil "~{~A~^~}" movements))))

(defparameter *input* (parse-input (aoc:input)))

(defparameter *example1*
  (parse-input
   '("########"
     "#..O.O.#"
     "##@.O..#"
     "#...O..#"
     "#.#.O..#"
     "#...O..#"
     "#......#"
     "########"
     ""
     "<^^>>>vv<v>>v<<")))

(defparameter *example2*
  (parse-input
   '("##########"
     "#..O..O.O#"
     "#......O.#"
     "#.OO..O.O#"
     "#..O@..O.#"
     "#O#..O...#"
     "#O..O..O.#"
     "#.OO.O.OO#"
     "#....O...#"
     "##########"
     ""
     "<vv>^<v^>v>^vv^v>v<>v^v<v<^vv<<<^><<><>>v<vvv<>^v^>^<<<><<v<<<v^vv^v>^"
     "vvv<<^>^v^^><<>>><>^<<><^vv^^<>vvv<>><^^v>^>vv<>v<<<<v<^v>^<^^>>>^<v<v"
     "><>vv>v^v^<>><>>>><^^>vv>v<^^^>>v^v^<^^>v^^>v^<^v>v<>>v^v^<v>v^^<^^vv<"
     "<<v<^>>^^^^>>>v^<>vvv^><v<<<>^^^vv^<vvv>^>v<^^^^v<>^>vvvv><>>v^<<^^^^^"
     "^><^><>>><>^^<<^^v>>><^<v>^<vv>>v>>>^v><>^v><<<<v>>v<v<v>vvv>^<><<>^><"
     "^>><>^v<><^vvv<^^<><v<<<<<><^v<<<><<<^^<v<^^^><^>>^<v^><<<^>>^v<v^v<v^"
     ">^>>^v>vv>^<<^v<>><<><<v<<v><>v<^vv<<<>^^v^>^^>>><<^v>>v^v><^^>>^<>vv^"
     "<><^^>^^^<><vvvvv^v<v<<>^v<v>v<<^><<><<><<<^^<<<^<<>><<><^^^>^^<>^>v<>"
     "^^>vv<^v^v<vv>^<><v<^v>^^^>>>^^vvv^>vvv<>>>^<^>>>>>^<<^v>^vvv<>^<><<v>"
     "v^^>>><<^^<>>^v^<v^vv<>v^<<>^<^v^v><^<<<><<^<v><v<>vv>>v><v^<vv<>v^<<^")))

;;; Part 1

(defun initial-position (map)
  (iter
    (for i from 0 below (array-dimension map 0))
    (iter
      (for j from 0 below (array-dimension map 1))
      (when (char= (aref map i j) #\@)
        (setf (aref map i j) #\.)
        (return-from initial-position (complex j i))))))

(defun instruction-to-direction (instruction)
  (case instruction
    (#\^ #C(0 -1))
    (#\v #C(0 1))
    (#\> #C(1 0))
    (#\< #C(-1 0))))

(defun follow-instruction (instruction position map)
  (labels ((next-free-position (pos dir)
             (let ((new-pos (+ pos dir)))
               (case (aoc:cref map new-pos)
                 (#\. new-pos)
                 (#\O (next-free-position new-pos dir))
                 (otherwise nil)))))
    (let* ((dir (instruction-to-direction instruction))
           (new-position (+ position dir)))
      (case (aoc:cref map new-position)
        (#\# position)
        (#\. new-position)
        (#\O
         (let ((next-free-spot (next-free-position position dir)))
           (if (null next-free-spot)
               position
               (progn
                 (setf (aoc:cref map next-free-spot) #\O
                       (aoc:cref map new-position)   #\.)
                 new-position))))))))

(defun follow-instructions (instructions map)
  (iter
    (for instruction in-string instructions)
    (for pos initially (initial-position map) then (follow-instruction instruction pos map))))

(defun calc-boxes-gps (map)
  (iter outer
    (for i from 0 below (array-dimension map 0))
    (iter
      (for j from 0 below (array-dimension map 1))
      (when (char= (aref map i j) #\O)
        (in outer (summing (+ (* 100 i) j)))))))

(defun get-answer-1 (&optional (input *input*))
  (destructuring-bind (map instructions) input
    (let ((map (alexandria:copy-array map)))
      (follow-instructions instructions map)
      (calc-boxes-gps map))))

(aoc:given 1
  (= 2028 (get-answer-1 *example1*))
  (= 10092 (get-answer-1 *example2*)))
